---
kind: method
id: M:Autodesk.Revit.DB.DisplacementElement.GetDisplacedElementIdsFromAllChildren
source: html/63740fb6-7911-9756-e4e1-c1377083216b.htm
---
# Autodesk.Revit.DB.DisplacementElement.GetDisplacedElementIdsFromAllChildren Method

The element ids of elements displaced by this DisplacementElement and any
 DisplacementElement which declare this one as parent.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetDisplacedElementIdsFromAllChildren()
```

## Returns
The element ids.